Catalogs/упТарифныеСетки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТарифныеСетки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеТарифнойСетки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтолбцам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтрокам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТарифныеСетки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьТаблицу(тбзТарифнаяСетка) Экспорт 
	Если Ложь Тогда // Для контекстной подсказки
	    тбзТарифнаяСетка = Новый ТаблицаЗначений;
	КонецЕсли;
	ЭтотОбъект.ИдентификаторыСсылок.Очистить();
	Для Каждого Колонка Из тбзТарифнаяСетка.Колонки Цикл
		ЗначениеПоказателя = ПреобразоватьЗначениеПоказателя(тбзТарифнаяСетка[0][Колонка.Имя]);
		тбзТарифнаяСетка[0][Колонка.Имя] = ЗначениеПоказателя;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из тбзТарифнаяСетка Цикл
		ЗначениеПоказателя = ПреобразоватьЗначениеПоказателя(СтрокаТаблицы[0]);
		СтрокаТаблицы[0] = ЗначениеПоказателя;
	КонецЦикла;
	ДанныеТарифнойСетки = Новый ХранилищеЗначения(тбзТарифнаяСетка);
	ЭтотОбъект.ДанныеТарифнойСетки = ДанныеТарифнойСетки;
КонецПроцедуры

Функция ПреобразоватьЗначениеПоказателя(ЗначениеПоказателя)
	
	Если упСервисныеФункции.ЛиТипСсылкиНаОбъектБД(ТипЗнч(ЗначениеПоказателя)) Тогда
		СтрокиТЧ = ЭтотОбъект.ИдентификаторыСсылок.НайтиСтроки(Новый Структура("Значение", ЗначениеПоказателя));
		Если СтрокиТЧ.Количество() > 0 Тогда
			СтрокаТЧ = СтрокиТЧ[0];
		Иначе
			СтрокаТЧ = ЭтотОбъект.ИдентификаторыСсылок.Добавить();
			СтрокаТЧ.Значение = ЗначениеПоказателя;
			СтрокаТЧ.Идентификатор = Новый УникальныйИдентификатор;
		КонецЕсли; 
		ЗначениеПоказателя = СтрокаТЧ.Идентификатор;
	КонецЕсли;
	Возврат ЗначениеПоказателя;

КонецФункции

#КонецОбласти

#КонецЕсли
